MasterHomebrewer/app/views/brewers/show.html.erb

SELECT "score_sheets".* FROM "score_sheets" WHERE "score_sheets"."brewer_id" = $1  [["brewer_id", 2]]
---
</tr>
<%= @brewer.score_sheets.each do |score_sheet| %>