MasterHomebrewer/app/controllers/brewers_controller.rb

SELECT "brewers".* FROM "brewers"
---
  def index
    @brewers = Brewer.all

INSERT INTO "brewers" ("first_name", "last_name", "club", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Barry"], ["last_name", "Forrest"], ["club", "Cap & Hare"], ["created_at", "2022-05-27 18:20:42.989073"], ["updated_at", "2022-05-27 18:20:42.989073"]]
---
  def create
    @brewer = Brewer.new(brewer_params)

    respond_to do |format|
      if @brewer.save

UPDATE "brewers" SET "club" = $1, "updated_at" = $2 WHERE "brewers"."id" = $3  [["club", "Cap & Hare"], ["updated_at", "2022-05-28 01:19:20.434126"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @brewer.update(brewer_params)

DELETE FROM "brewers" WHERE "brewers"."id" = $1  [["id", 1]]
---
  def destroy
    @brewer.destroy

SELECT "brewers".* FROM "brewers" WHERE "brewers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_brewer
      @brewer = Brewer.find(params[:id])