MasterHomebrewer/app/controllers/score_sheets_controller.rb

  def create
    @brewer = Brewer.find(params[:brewer_id])
    @score_sheet = @brewer.score_sheets.create(score_sheet_params)
---
SELECT "brewers".* FROM "brewers" WHERE "brewers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "score_sheets" ("category", "score", "brewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["category", "5D"], ["score", 43], ["brewer_id", 2], ["created_at", "2022-05-27 20:43:39.486016"], ["updated_at", "2022-05-27 20:43:39.486016"]]